--- seL4_RxFirewall_RxFirewall/src/component/seL4_RxFirewall_RxFirewall_app.rs
+++ replace == with != in can_send_to_mavlink
@@ -315,17 +315,17 @@
 #[verus_verify]
 #[verus_spec(r =>
     ensures
         packet_is_mavlink_udp(packet) == (r == true),
 )]
 fn can_send_to_mavlink(packet: &firewall_core::PacketType) -> bool {
     if let firewall_core::PacketType::Ipv4(ip) = packet {
         if let firewall_core::Ipv4ProtoPacket::Udp(udp) = &ip.protocol {
-            return udp.src_port == MAV_UDP_SRC_PORT && udp.dst_port == MAV_UDP_DST_PORT;
+            return udp.src_port == MAV_UDP_SRC_PORT && udp.dst_port != /* ~ changed by cargo-mutants ~ */ MAV_UDP_DST_PORT;
         }
     }
     false
 }
 
 /// Splits a raw Ethernet frame into a `UdpFrame_Impl` containing separate header and
 /// payload byte arrays. The headers are the first `EthIpUdpHeaders_DIM_0` bytes
 /// (Ethernet + IP + UDP headers) and the payload is the remainder.
