--- seL4_RxFirewall_RxFirewall/src/component/seL4_RxFirewall_RxFirewall_app.rs
+++ delete match arm firewall_core::Ipv4ProtoPacket::Udp(udp) in can_send_to_vmm
@@ -399,23 +399,17 @@
         config::udp::ALLOWED_PORTS =~= GumboLib::UDP_ALLOWED_PORTS_spec(),
     ensures
         ((packet is Arp) || packet_is_whitelisted_udp(packet)) == (r == true),
 )]
 fn can_send_to_vmm(packet: &firewall_core::PacketType) -> bool {
     match packet {
         firewall_core::PacketType::Arp(_) => true,
         firewall_core::PacketType::Ipv4(ip) => match &ip.protocol {
-            firewall_core::Ipv4ProtoPacket::Udp(udp) => {
-                let allowed = udp_port_allowed(udp.dst_port);
-                if !allowed {
-                    log_info("UDP packet filtered out");
-                }
-                allowed
-            }
+             /* ~ changed by cargo-mutants ~ */
             _ => {
                 info_protocol(ip.header.protocol);
                 false
             }
         },
         firewall_core::PacketType::Ipv6 => {
             log_info("Not an IPv4 or Arp packet. Throw it away.");
             false
