--- seL4_RxFirewall_RxFirewall/src/component/seL4_RxFirewall_RxFirewall_app.rs
+++ delete ! in can_send_to_vmm
@@ -401,17 +401,17 @@
         ((packet is Arp) || packet_is_whitelisted_udp(packet)) == (r == true),
 )]
 fn can_send_to_vmm(packet: &firewall_core::PacketType) -> bool {
     match packet {
         firewall_core::PacketType::Arp(_) => true,
         firewall_core::PacketType::Ipv4(ip) => match &ip.protocol {
             firewall_core::Ipv4ProtoPacket::Udp(udp) => {
                 let allowed = udp_port_allowed(udp.dst_port);
-                if !allowed {
+                if  /* ~ changed by cargo-mutants ~ */allowed {
                     log_info("UDP packet filtered out");
                 }
                 allowed
             }
             _ => {
                 info_protocol(ip.header.protocol);
                 false
             }
