--- seL4_RxFirewall_RxFirewall/src/component/seL4_RxFirewall_RxFirewall_app.rs
+++ replace port_allowed -> bool with false
@@ -446,30 +446,16 @@
 /// Generic allowlist check: linearly scans `allowed_ports` and returns true if `port`
 /// is found. Used by both `udp_port_allowed` and `tcp_port_allowed`.
 #[verus_verify]
 #[verus_spec(r =>
     ensures
         r == allowed_ports@.contains(port),
 )]
 fn port_allowed(allowed_ports: &[u16], port: u16) -> bool {
-    let mut i: usize = 0;
-    #[verus_spec(
-        invariant
-            0 <= i <= allowed_ports@.len(),
-            forall |j| 0 <= j < i ==> allowed_ports@[j] != port,
-        decreases
-            allowed_ports@.len() - i,
-    )]
-    while i < allowed_ports.len() {
-        if allowed_ports[i] == port {
-            return true;
-        }
-        i += 1;
-    }
-    false
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// Logs the IP protocol number of a dropped packet (neither TCP nor UDP).
 #[verus_verify(external_body)]
 fn info_protocol(protocol: firewall_core::IpProtocol) {
     log::info!("Not a TCP or UDP packet. ({:?}) Throw it away.", protocol);
 }
